CC := gcc
FLAGS := -fopenmp
C := $(CC) $(FLAGS)
PROG_PREFIX := avs_prog_

# если make запускать без аргументов, то запускается правило all
# удобно если нужно запустить сразу все программы
# P.S. при добавлении новой "программы" (файла в src/),
#     нужно сюда добавить его имя (других изменений в Makefile не требуется)
# P.P.S. если all не нужен, то можешь вообще удалить эту строчку

all: 1 2 3 4

%: src/%.c
	@$(C) $? -o /tmp/${PROG_PREFIX}$@ && /tmp/${PROG_PREFIX}$@

# строчка выше разворачивается в то что ниже, и так для каждого файла в src/

# src/a: src/a.rs
# 	@$(C) $? -o /tmp/lab_prog_$@ && /tmp/lab_prog_$@

# src/b: src/b.rs
# 	@$(C) $? -o /tmp/lab_prog_$@ && /tmp/lab_prog_$@
